In [49]:
import numpy as np
import pandas as pd

In [50]:
import os
for dirname, _, filenames in os.walk('C:\\Users\\ASUS\\Desktop\\datasets\\titanic'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

C:\Users\ASUS\Desktop\datasets\titanic\test.csv
C:\Users\ASUS\Desktop\datasets\titanic\train.csv

In [51]:
import matplotlib.pyplot as plt
import seaborn as sns

In [58]:
train = pd.read_csv('C:\\Users\\ASUS\\Desktop\\datasets\\titanic\\train.csv')
test = pd.read_csv('C:\\Users\\ASUS\\Desktop\\datasets\\titanic\\test.csv')

In [59]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

This parameters does not impact the outcome of the prediction

In [60]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [61]:
train.drop(['PassengerId','Cabin','Ticket', 'Name'], axis=1, inplace=True)
test.drop(['PassengerId','Cabin','Ticket','Name'], axis=1,inplace=True)

In [13]:
train.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [17]:
train['Embarked'] = train['Embarked'].fillna(train['Embarked'].mode()[0])

In [64]:
train['Sex'] = train['Sex'].replace({'male':0, 'female':1})
train['Embarked'] = train['Embarked'].replace({'C':0, 'Q':1, 'S':2})

test['Sex'] = test['Sex'].replace({'male':0, 'female':1})
test['Embarked'] = test['Embarked'].replace({'C':0, 'Q':1, 'S':2})
train.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.0      1      0   7.2500       2.0
1         1       1    1  38.0      1      0  71.2833       0.0
2         1       3    1  26.0      0      0   7.9250       2.0
3         1       1    1  35.0      1      0  53.1000       2.0
4         0       3    0  35.0      0      0   8.0500       2.0

In [65]:
col = 'Family'

In [66]:
train[col] = train['SibSp'] + train['Parch']
test['Family'] = test['SibSp'] + test['Parch']

In [68]:
train.groupby(['Sex', 'Family']).mean()['Survived']

Sex  Family
0    0         0.155718
     1         0.243243
     2         0.396226
     3         0.500000
     4         0.000000
     5         0.000000
     6         0.250000
     7         0.000000
     10        0.000000
1    0         0.785714
     1         0.816092
     2         0.775510
     3         0.842105
     4         0.250000
     5         0.375000
     6         0.375000
     7         0.000000
     10        0.000000
Name: Survived, dtype: float64

In [71]:
from sklearn.ensemble import RandomForestRegressor
age = train[['Age', 'Pclass', 'SibSp', 'Parch']]

In [72]:
age

      Age  Pclass  SibSp  Parch
0    22.0       3      1      0
1    38.0       1      1      0
2    26.0       3      0      0
3    35.0       1      1      0
4    35.0       3      0      0
..    ...     ...    ...    ...
886  27.0       2      0      0
887  19.0       1      0      0
888   NaN       3      1      2
889  26.0       1      0      0
890  32.0       3      0      0

[891 rows x 4 columns]

In [73]:
know_age = age[age['Age'].notnull()].values
unknow_age = age[age['Age'].isnull()].values

In [79]:
X = know_age[:, 1:]

In [77]:
y = know_age[:, 0]

In [80]:
X

array([[3., 1., 0.],
       [1., 1., 0.],
       [3., 0., 0.],
       ...,
       [1., 0., 0.],
       [1., 0., 0.],
       [3., 0., 0.]])

In [84]:
rf = RandomForestRegressor()

In [85]:
rf.fit(X,y)

RandomForestRegressor()

In [86]:
predictAge = rf.predict(unknow_age[:, 1::])

In [47]:
predictAge

array([28.25982312, 33.91837656, 28.25982312, 28.25982312, 28.25982312,
       28.25982312, 37.25402404, 28.25982312, 28.25982312, 28.25982312,
       28.25982312, 24.95249591, 28.25982312, 27.92410495, 40.91108132,
       40.91108132, 21.0568837 , 28.25982312, 28.25982312, 28.25982312,
       28.25982312, 28.25982312, 28.25982312, 28.25982312, 24.95249591,
       28.25982312, 28.25982312, 21.0568837 , 20.52144041, 28.25982312,
       28.25982312, 10.35384524, 37.4310796 , 40.91108132,  4.23915476,
       10.35384524, 33.91837656, 40.91108132, 24.95249591, 28.25982312,
       28.25982312, 10.35384524, 24.95249591, 28.25982312,  4.23915476,
       28.25982312, 24.95249591, 24.95249591, 28.25982312, 40.91108132,
       28.25982312, 28.25982312, 40.91108132, 28.25982312, 33.91837656,
       40.91108132, 40.91108132, 40.91108132, 28.25982312, 27.92410495,
       33.91837656, 28.25982312, 40.91108132, 10.35384524, 27.92410495,
       37.25402404, 28.25982312, 24.95249591, 40.91108132, 28.25982312,
       28.25982312, 28.25982312, 24.95249591, 28.25982312, 28.25982312,
       37.25402404, 28.25982312, 28.25982312,  4.23915476, 28.25982312,
       28.25982312, 33.91837656, 28.25982312, 28.25982312, 28.25982312,
       28.25982312, 24.95249591, 28.25982312, 24.95249591, 28.25982312,
       37.25402404, 28.25982312, 28.25982312, 33.91837656, 28.25982312,
       28.25982312, 40.91108132, 33.91837656,  4.23915476, 24.95249591,
       28.25982312, 28.25982312, 28.25982312, 40.91108132, 28.25982312,
       28.25982312, 28.25982312, 28.25982312, 40.91108132, 28.25982312,
       20.52144041, 28.25982312, 33.91837656, 28.25982312, 40.91108132,
       28.25982312, 28.25982312, 28.25982312, 28.25982312, 28.25982312,
       24.95249591, 28.25982312, 28.25982312, 20.52144041, 33.91837656,
       28.25982312, 28.25982312, 40.91108132, 28.25982312, 24.95249591,
       28.25982312, 28.25982312, 40.91108132, 24.95249591, 28.25982312,
       28.25982312, 28.25982312, 28.25982312, 28.25982312, 28.25982312,
       37.25402404, 33.91837656, 28.25982312, 28.25982312, 28.25982312,
       21.0568837 , 40.91108132, 28.25982312, 28.25982312, 33.91837656,
       28.25982312, 28.25982312, 40.91108132, 28.25982312, 40.91108132,
       24.95249591, 28.25982312, 28.25982312, 28.25982312, 14.80362102,
       28.25982312, 10.35384524, 40.91108132, 40.91108132, 28.25982312,
       28.25982312, 28.25982312, 28.25982312, 28.25982312, 40.91108132,
       10.35384524, 37.25402404, 28.25982312, 10.35384524, 28.25982312,
       28.25982312, 14.80362102])